lab5/kody/extapp/src/jbiasa/extapp.wsdl

<?xml version="1.0" encoding="UTF-8"?>

<!--
  This file is auto-generated by CASA. 
  Edit its content manually may cause unrecoverable errors.
-->

<definitions xmlns="http://schemas.xmlsoap.org/wsdl/"
             xmlns:wsdl="http://schemas.xmlsoap.org/wsdl/"
             xmlns:xsd="http://www.w3.org/2001/XMLSchema"
             targetNamespace="extapp"
             xmlns:tns="extapp" xmlns:ns="http://j2ee.netbeans.org/wsdl/extservice2/src/newWSDL" xmlns:soap="http://schemas.xmlsoap.org/wsdl/soap/" xmlns:ns1="http://ws.cdyne.com/">
    <import namespace="http://j2ee.netbeans.org/wsdl/extservice2/src/newWSDL" location="../jbiServiceUnits/extservice2/newWSDL.wsdl"/>
    <import namespace="http://ws.cdyne.com/" location="../jbiServiceUnits/extservice2/ws.cdyne.com/ip2geo/ip2geo.asmx.wsdl"/>
    <portType name="dummyCasaPortType"/>
    <binding name="casaBinding1" type="ns:newWSDLPortType">
        <soap:binding style="rpc" transport="http://schemas.xmlsoap.org/soap/http"/>
        <operation name="newWSDLOperation">
            <soap:operation/>
            <input name="input1">
                <soap:body use="literal" namespace="extapp"/>
            </input>
            <output name="output1">
                <soap:body use="literal" namespace="extapp"/>
            </output>
        </operation>
    </binding>
    <binding name="casaBinding2" type="ns1:IP2GeoSoap">
        <soap:binding style="document" transport="http://schemas.xmlsoap.org/soap/http"/>
        <operation name="ResolveIP">
            <soap:operation/>
            <input>
                <soap:body use="literal"/>
            </input>
            <output>
                <soap:body use="literal"/>
            </output>
        </operation>
    </binding>
    <service name="extappService1">
        <port name="casaPort1" binding="tns:casaBinding1">
            <soap:address location="http://localhost:${HttpDefaultPort}/extappService1/casaPort1"/>
        </port>
    </service>
    <service name="extappService2">
        <port name="casaPort2" binding="tns:casaBinding2">
            <soap:address location="http://ws.cdyne.com/ip2geo/ip2geo.asmx"/>
        </port>
    </service>
</definitions>
