ip2geo.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/"
    xmlns:ws="http://ws.cdyne.com/">
    <soapenv:Header/>
    <soapenv:Body>
        <ws:ResolveIP>
            <!--Optional:-->
            <ws:ipAddress>181.58.38.103</ws:ipAddress>
            <!--Optional:-->
            <ws:licenseKey>0</ws:licenseKey>
        </ws:ResolveIP>
    </soapenv:Body>
</soapenv:Envelope>